app/controllers/pages_controller.rb

SELECT * FROM "pages" WHERE ("pages"."user_id" = 1) LIMIT 1
SELECT * FROM "pages"
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @pages = Page.find_all_by_user_id(session[:user_id])
    @directories = ["root"]
    @pages.each { |page|

      new_path = page.file.path.split(page.user_id.to_s)[1]
      splits = new_path.split("/");

      (@directories << splits[1]) if (splits.size == 3 && !@directories.include?(splits[1]))
      (@directories << "#{splits[1]}/#{splits[2]}") if
        (splits.size == 4 && !@directories.include?("#{splits[1]}/#{splits[2]}"))
      (@directories << "#{splits[1]}/#{splits[2]}/#{splits[3]}") if
        (splits.size == 5 && !@directories.include?("#{splits[1]}/#{splits[2]}/#{splits[3]}"))

    }

    @directories
    @pages
    @user = User.find(session[:user_id])

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
SELECT * FROM "rules"
---
  def show
    @page = Page.find(params[:id])
    @rules = Rule.all

SELECT * FROM "pages" WHERE ("pages"."id" = 17)
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO "pages" ("created_at", "updated_at", "file_content_type", "file_file_size", "file_file_name", "user_id", "file_subpath", "alias") VALUES('2010-10-20 21:39:48', '2010-10-20 21:39:48', 'image/png', 11418, 'user-icon.png', 11, '', '/home/ggtesta/rails22.3/TCC/PrankDev/public/users_files/11/user-icon')
---



    if @page.save

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
DELETE FROM "pages" WHERE "id" = 1
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy