app/controllers/rules_controller.rb

SELECT * FROM "rules" WHERE ("rules"."page_id" IS NULL)
SELECT * FROM "pages" WHERE ("pages"."id" = '--- :page_id
---
  def index
    @rules = Rule.find_all_by_page_id(params[:page_id])
    @page = Page.find(params[:page_id])

SELECT * FROM "rules" WHERE ("rules"."id" = 1)
---
  def show
    @rule = Rule.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 17)
---
  def new
    @rule = Rule.new
    @page = Page.find(params[:page_id])

SELECT * FROM "rules" WHERE ("rules"."id" = 1)
---
  def edit
    @rule = Rule.find(params[:id])

INSERT INTO "rules" ("created_at", "attr_value", "new_text", "updated_at", "css_selector", "attribute") VALUES('2010-09-24 23:12:12', 'http://www.google.com', 'Google', '2010-09-24 23:12:12', 'li:nth-child(3) li:nth-child(1) a', 'link')
---
  def create
    @rule = Rule.new(params[:rule])


    if @rule.save

SELECT * FROM "rules" WHERE ("rules"."id" = 1)
UPDATE "rules" SET "updated_at" = '2010-09-30 15:19:55', "value" = 'http://www.progesp.ufrgs.br/progesp-1/concursos-publicos/magisterio-superior/concuros/2010', "text" = 'Para maiores informações: http://www.progesp.ufrgs.br/progesp-1/concursos-publicos/magisterio-superior/concuros/2010.' WHERE "id" = 80
---
  def update
    @rule = Rule.find(params[:id])
    @page = @rule.page.id

    if @rule.update_attributes(params[:rule])

SELECT * FROM "rules" WHERE ("rules"."id" = 1)
SELECT * FROM "pages" WHERE ("pages"."id" = 17)
DELETE FROM "rules" WHERE "id" = 1
---
  def destroy
    @rule = Rule.find(params[:id])
    page_id = @rule.page.id
    @rule.destroy