app/controllers/transform_controller.rb

  def index
    @page = Page.find(params[:page_id])
    @rules = Rule.find_all_by_page_id(@page.id)
---
SELECT * FROM "pages" WHERE ("pages"."id" = 1) LIMIT 1
SELECT * FROM "rules" WHERE ("rules"."page_id" = 17)