app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :username)

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
    @user = User.find(session[:user_id])

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "username", "hashed_password") VALUES('Guilherme', '-6132735680.226903618998341', '2010-09-28 18:44:11', '2010-09-28 18:44:11', 'ggtesta', '7199db54f701bcb9f061cb6af0dcf4fa74cc0a03')
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-09-30 15:58:05', "salt" = '-6132057580.0086958739216727', "hashed_password" = 'a8cdae5bdc31d7723d8040cd420752b760b8a04e', "name" = 'Administrador' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1
DELETE FROM "users" WHERE "id" = 6
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy